src/InformationRegisters/ModulesData.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ModulesData</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AST</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ParsingDuration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Module</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GitSHA1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ModulesData/Ext/ManagerModule.bsl
Function MarshalAST(Module, GitSHA1) Export	
	
	JSONWriter = New JSONWriter;
	TempFileName = GetTempFileName(".json");
	JSONWriter.OpenFile(TempFileName,,, New JSONWriterSettings(, Chars.Tab));
	WriteJSON(JSONWriter, AST(Module, GitSHA1));
	JSONWriter.Close();
	TextReader = New TextReader(TempFileName, TextEncoding.UTF8);
	
	Return TextReader.Read();		
EndFunction // MarshalAST()

Function AST(Module, GitSHA1)
	
	Query = New Query;
	Query.SetParameter("Module", Module);
	Query.SetParameter("GitSHA1", GitSHA1);
	Query.Text =
	"SELECT
	|	ModulesData.AST AS AST
	|FROM
	|	InformationRegister.ModulesData AS ModulesData
	|WHERE
	|	ModulesData.Module = &Module
	|	AND ModulesData.GitSHA1 = &GitSHA1";
	
	QueryResult = Query.Execute();
	
	If Not QueryResult.IsEmpty() Then
		Rider = QueryResult.Select();
		Rider.Next();
		Return Rider.AST.Get();
	EndIf; 
	
	Return Undefined;
	
EndFunction // AST()
